
// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

// let array = [10, 15, 1, 3, 25, 37, 3, 9, 0];
//
// console.log (array[0]+ array[1]+ array[2]+ array[3] + array[4]+ array[5] + array[6]+ array[7]+ array[8]);

// let result =


// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр

//  let book = {
//      name: 'Future',
//      pages: 102,
//      genre: 'comedy',
//  };
//
// console.log(book.name);




// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let book1 = {
//     name: 'Future',
//     pages: 102,
//     genre: 'comedy',
//     author: 'good',
// };

// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт


// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let sq = 23*10;
// console.log(sq);

// let a = 23
// let b = 10
// let s = a*b
// console.log(s);

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
//
// let r = 2;
// let h = 10;
// let s = Math.PI * r**2 * h;
// console.log(s);


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
// let d = 3;
// let q = 4;
// let z = Math.sqrt(d ** 2 + q ** 2);
// console.log(z);

